tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "openssl@1.1"
brew "apr-util"
brew "berkeley-db"
brew "carthage"
brew "cmake"
brew "cocoapods"
brew "openldap"
brew "curl"
brew "unixodbc"
brew "freetds"
brew "git"
brew "gmp"
brew "jpeg", link: true
brew "krb5"
brew "libarchive"
brew "libpq"
brew "libyaml"
brew "libzip"
brew "ninja"
brew "node", link: false
brew "openssl@3"
brew "ossp-uuid"
brew "pcre"
brew "readline"
brew "sqlite"
brew "php@8.0", link: true
brew "rbenv"
brew "ruby"
brew "swi-prolog"
brew "yarn"
